app/controllers/tag_controller.rb

  def create
    @tag = Tag.new(name: params[:name])
    @tag.save
---
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "test"], ["created_at", "2020-04-25 07:01:02.624073"], ["updated_at", "2020-04-25 07:01:02.624073"]]

  def show
    @tag = Tag.find_by(id: params[:id])
---
SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def destroy
    tag = Tag.find_by(id: params[:id])
    tag.destroy
---
SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 7]]