app/controllers/todo_controller.rb

  def index
    @todos = Todo.all
    @tags = Tag.all
---
SELECT "todos".* FROM "todos"
SELECT "tags".* FROM "tags"

  def new
    @tags = Tag.all
---
SELECT "tags".* FROM "tags"

  def create
    @todo = Todo.new(content: params[:content], tag: params[:tag], priority: params[:priority])
    @todo.save
    if @todo.save
      flash[:notice] = "Successfully created the new ToDo."
      redirect_to("/todo/index")
    else
      flash[:notice] = "Content is needed."
      @tags = Tag.all
---
INSERT INTO "todos" ("content", "tag", "priority", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "テスト"], ["tag", "test"], ["priority", 1], ["created_at", "2020-04-25 07:11:11.759240"], ["updated_at", "2020-04-25 07:11:11.759240"]]
SELECT "tags".* FROM "tags"

  def show
    @todo = Todo.find_by(id: params[:id])
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def change
    @todo = Todo.find_by(id: params[:id])
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

  def update
    @todo = Todo.find_by(id: params[:id])
    @todo.content = params[:content]
    @todo.tag = params[:tag]
    @todo.priority = params[:priority]
    @todo.save
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "todos" SET "content" = ?, "priority" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["content", "カルメリーナLB"], ["priority", 1], ["updated_at", "2020-05-02 03:35:43.596930"], ["id", 11]]

  def destroy
    todo = Todo.find_by(id: params[:id])
    todo.destroy
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 9]]