app/controllers/todo_controller.rb

SELECT "todos".* FROM "todos" ORDER BY "todos"."priority" ASC
---
  def index
    @todos = Todo.all.order(priority: "ASC")